from math import sqrt, sin


# 3 задание


def zad_3(a: int, b: int):
    print(f"Среднее арифметическое: {(a + b) / 2}")
    print(f"Среднее геометрическое: {sqrt(a * b)}")


# 4 задание


def zad_4(num: int):
    a = num // 10
    b = num % 10

    print(f"Сумма: {a + b} \t Різниця: {a - b} \t Частка: {a / b} \t Добуток: {a * b}")


# 5 задание


def zad_5(a: int):
    print(f"Об'єм куба: {pow(a, 3)}")
    print(f"Площа поверхні куба: {6 * pow(a, 2)}")


# 6 задание


def zad_6(mass: int, a: int):
    print(f"Рівнодійна сил: {mass * a}")


# 7 задание
# только b может быть гипотенузой


def zad_7(a: int, b: int):
    # a)
    print(f"Площа прямокутного трикутника: {(a * b) / 2}")
    # б)
    print(f"Площа прямокутного трикутника: {(sqrt(b ** 2 - a ** 2) * a) / 2}")


# 8 задание


def zad_8(t: int):
    s = 3 * pow(t, 3) - 4 * pow(t, 2) + 7
    v = s / t
    a = v / t

    print(f"Шлях: {s} \t Швидкість: {v} \t Прискорення: {a}")


# 9 задание


def zad_9(a: int):
    print(f"Радіус кола вписаного в квадрат: {a / 2}")
    print(f"Радіус кола описаного навколо квадрату: {a * (sqrt(2) / 2)}")


# 10 задание


def zad_10(r1: int, r2: int, r3: int):
    print(f"Загальний опір(послідовно): {r1 + r2 + r3}")
    # Reworked
    print(f"Загальний опір(паралельно): {1/((1 / r1) + (1 / r2) + (1 / r3))}")


# 11 задание


def zad_11():
    num = int(input())
    print(num ** 15)


# 12 задание


def zad_12(square: int):
    rulon = 3  # 3 м²
    print(f"Для кімнати площею {square} потрібно {square / rulon} рулонів")


# 13 задание


def zad_13(n: int):
    # if n % 2 == 0:
    # print(n + 2)
    # else:
    # print(n + 1)

    # Reworked
    a = n % 2
    print(f"Найменше парне число, що бiльше за {n} = {n + a + 2}")


# 14 задание


def zad_14(s: int, v: float):
    t = s / v
    print(f"Потрібно: {round(t)} діб")


# 15 задание


def zad_15(num: int):
    a = num // 1000
    b = num % 1000 // 100
    c = num % 100 // 10
    d = num % 10
    if a == d and b == c:
        print(1)
    else:
        print(0)


#       Задания из презентации      #


# Дано ціле число n. Виведіть наступне за ним парне число.


def zad_16(n: int):
    if n % 2 == 0:
        print(n + 2)
    else:
        print(n + 1)


# Поміняти місцями значення двох змінних без використання третьої.


def zad_17(a: int, b: int):
    b += a
    a = b - a
    b = b - a

    print(a, b)


# Визначити значення виразу, використовуючи математичні функції, і вивести результат на екран. Значення змінних ввести з клавіатури.


def zad_18():
    a = int(input("A: "))
    b = int(input("B: "))
    c = int(input("C: "))
    d = int(input("D: "))

    print(f"x = {(2 * a - pow(b, 2)) / d * (sin(c) - 4.5)}\n")
    print(f"x = {pow(a, 2) + abs(sin(b / pow(c - d, 0.5)))}")


# Дано тризначне число. Знайти число, що одержиться при перестановці першої і останньої цифр.


def zad_19(num: int):
    a = num // 100
    b = num % 100 // 10
    c = num % 10

    print(c, b, a, sep="")


# Дано чотиризначне число. Визначте, чи є його десятковий запис симетричним. Якщо число симетричне, то надрукуйте 1, інакше надрукуйте будь-яке інше ціле число.
# Рішення задачі в функції zad_15


# Дано дійсне число a. Користуючись тільки операцією множення, одержати a15 за п'ять операцій.


def zad_20(a: int):
    a1 = a * a
    a2 = a1 * a1
    a3 = a2 * a
    a4 = a3 * a3 * a3

    print(f"a^15 = {a4}")


if __name__ == "__main__":
    zad_13(13)
    exit(0)
